using System;
using System.Collections.Generic;
using System.Text;
using System.Data.SqlTypes;

namespace VTNT.Database.Utility.String
{
    class CStringConvert
    {
        public static string ToHopToUnicode(string str)
        {
            string[] UNICODEToHop ={"a","â","ă","e","ê","i","o","ô","ơ","u","ư","y","A","Â","Ă","E","Ê","I","O","Ô","Ơ","U","Ư","Y","á","ấ","ắ","é","ế","í","ó","ố","ớ","ú","ứ","ý","Á","Ấ","Ắ","É","Ế","Í","Ó","Ố","Ớ","Ú","Ứ","Ý","à","ầ","ằ","è","ề","ì","ò","ồ","ờ","ù","ừ","ỳ","À","Ầ","Ằ","È","Ề","Ì","Ò","Ồ","Ờ","Ù","Ừ","Ỳ","ạ","ậ","ặ","ẹ","ệ","ị","ọ","ộ","ợ","ụ","ự","ỵ","Ạ","Ậ","Ặ","Ẹ","Ệ","Ị","Ọ","Ộ","Ợ","Ụ","Ự","Ỵ","ả","ẩ","ẳ","ẻ","ể","ỉ","ỏ","ổ","ở","ủ","ử","ỷ","Ả","Ẩ","Ẳ","Ẻ","Ể","Ỉ","Ỏ","Ổ","Ở","Ủ","Ử","Ỷ","ã","ẫ","ẵ","ẽ","ễ","ĩ","õ","ỗ","ỡ","ũ","ữ","ỹ","Ã","Ẫ","Ẵ","Ẽ","Ễ","Ĩ","Õ","Ỗ","Ỡ","Ũ","Ữ","Ỹ","d","đ","D","Đ" };
            int[] UNICODE ={97,226,259,101,234,105,111,244,417,117,432,121,65,194,258,69,202,73,79,212,416,85,431,89,225,7845,7855,233,7871,237,243,7889,7899,250,7913,253,193,7844,7854,201,7870,205,211,7888,7898,218,7912,221,224,7847,7857,232,7873,236,242,7891,7901,249,7915,7923,192,7846,7856,200,7872,204,210,7890,7900,217,7914,7922,7841,7853,7863,7865,7879,7883,7885,7897,7907,7909,7921,7925,7840,7852,7862,7864,7878,7882,7884,7896,7906,7908,7920,7924,7843,7849,7859,7867,7875,7881,7887,7893,7903,7911,7917,7927,7842,7848,7858,7866,7874,7880,7886,7892,7902,7910,7916,7926,227,7851,7861,7869,7877,297,245,7895,7905,361,7919,7929,195,7850,7860,7868,7876,296,213,7894,7904,360,7918,7928,100,273,68,272 };

            if (str==null || str =="") return "";
            int couter=147;
            string charToHop,charUnicode;
            while(couter >=0)
            {
                charToHop = UNICODEToHop[couter];
                charUnicode =char.ConvertFromUtf32(UNICODE[couter]);
                if(str.Contains(charToHop))
                {
                    str = str.Replace(charToHop,charUnicode);
                }
                couter --;
            }
            return str;
            //DECLARE @UNICODEToHop AS TABLE(ID int,Value nvarchar(3))
	//INSERT INTO @UNICODEToHop(ID,Value)
	//VALUES (1,"a'),(2,"â'),(3,N'ă'),(4,N'e'),(5,N'ê'),(6,N'i'),(7,N'o'),(8,N'ô'),(9,N'ơ'),(10,N'u'),(11,N'ư'),(12,N'y'),(13,N'A'),(14,N'Â'),(15,N'Ă'),(16,N'E'),(17,N'Ê'),(18,N'I'),(19,N'O'),(20,N'Ô'),(21,N'Ơ'),(22,N'U'),(23,N'Ư'),(24,N'Y'),(25,N'á'),(26,N'ấ'),(27,N'ắ'),(28,N'é'),(29,N'ế'),(30,N'í'),(31,N'ó'),(32,N'ố'),(33,N'ớ'),(34,N'ú'),(35,N'ứ'),(36,N'ý'),(37,N'Á'),(38,N'Ấ'),(39,N'Ắ'),(40,N'É'),(41,N'Ế'),(42,N'Í'),(43,N'Ó'),(44,N'Ố'),(45,N'Ớ'),(46,N'Ú'),(47,N'Ứ'),(48,N'Ý'),(49,N'à'),(50,N'ầ'),(51,N'ằ'),(52,N'è'),(53,N'ề'),(54,N'ì'),(55,N'ò'),(56,N'ồ'),(57,N'ờ'),(58,N'ù'),(59,N'ừ'),(60,N'ỳ'),(61,N'À'),(62,N'Ầ'),(63,N'Ằ'),(64,N'È'),(65,N'Ề'),(66,N'Ì'),(67,N'Ò'),(68,N'Ồ'),(69,N'Ờ'),(70,N'Ù'),(71,N'Ừ'),(72,N'Ỳ'),(73,N'ạ'),(74,N'ậ'),(75,N'ặ'),(76,N'ẹ'),(77,N'ệ'),(78,N'ị'),(79,N'ọ'),(80,N'ộ'),(81,N'ợ'),(82,N'ụ'),(83,N'ự'),(84,N'ỵ'),(85,N'Ạ'),(86,N'Ậ'),(87,N'Ặ'),(88,N'Ẹ'),(89,N'Ệ'),(90,N'Ị'),(91,N'Ọ'),(92,N'Ộ'),(93,N'Ợ'),(94,N'Ụ'),(95,N'Ự'),(96,N'Ỵ'),(97,N'ả'),(98,N'ẩ'),(99,N'ẳ'),(100,N'ẻ'),(101,N'ể'),(102,N'ỉ'),(103,N'ỏ'),(104,N'ổ'),(105,N'ở'),(106,N'ủ'),(107,N'ử'),(108,N'ỷ'),(109,N'Ả'),(110,N'Ẩ'),(111,N'Ẳ'),(112,N'Ẻ'),(113,N'Ể'),(114,N'Ỉ'),(115,N'Ỏ'),(116,N'Ổ'),(117,N'Ở'),(118,N'Ủ'),(119,N'Ử'),(120,N'Ỷ'),(121,N'ã'),(122,N'ẫ'),(123,N'ẵ'),(124,N'ẽ'),(125,N'ễ'),(126,N'ĩ'),(127,N'õ'),(128,N'ỗ'),(129,N'ỡ'),(130,N'ũ'),(131,N'ữ'),(132,N'ỹ'),(133,N'Ã'),(134,N'Ẫ'),(135,N'Ẵ'),(136,N'Ẽ'),(137,N'Ễ'),(138,N'Ĩ'),(139,N'Õ'),(140,N'Ỗ'),(141,N'Ỡ'),(142,N'Ũ'),(143,N'Ữ'),(144,N'Ỹ'),(145,N'd'),(146,N'đ'),(147,N'D'),(148,N'Đ') 
	//DECLARE @UNICODE AS TABLE(ID int ,Value int)
	//INSERT INTO @UNICODE(ID,Value)
	//VALUES(1,97),(2,226),(3,259),(4,101),(5,234),(6,105),(7,111),(8,244),(9,417),(10,117),(11,432),(12,121),(13,65),(14,194),(15,258),(16,69),(17,202),(18,73),(19,79),(20,212),(21,416),(22,85),(23,431),(24,89),(25,225),(26,7845),(27,7855),(28,233),(29,7871),(30,237),(31,243),(32,7889),(33,7899),(34,250),(35,7913),(36,253),(37,193),(38,7844),(39,7854),(40,201),(41,7870),(42,205),(43,211),(44,7888),(45,7898),(46,218),(47,7912),(48,221),(49,224),(50,7847),(51,7857),(52,232),(53,7873),(54,236),(55,242),(56,7891),(57,7901),(58,249),(59,7915),(60,7923),(61,192),(62,7846),(63,7856),(64,200),(65,7872),(66,204),(67,210),(68,7890),(69,7900),(70,217),(71,7914),(72,7922),(73,7841),(74,7853),(75,7863),(76,7865),(77,7879),(78,7883),(79,7885),(80,7897),(81,7907),(82,7909),(83,7921),(84,7925),(85,7840),(86,7852),(87,7862),(88,7864),(89,7878),(90,7882),(91,7884),(92,7896),(93,7906),(94,7908),(95,7920),(96,7924),(97,7843),(98,7849),(99,7859),(100,7867),(101,7875),(102,7881),(103,7887),(104,7893),(105,7903),(106,7911),(107,7917),(108,7927),(109,7842),(110,7848),(111,7858),(112,7866),(113,7874),(114,7880),(115,7886),(116,7892),(117,7902),(118,7910),(119,7916),(120,7926),(121,227),(122,7851),(123,7861),(124,7869),(125,7877),(126,297),(127,245),(128,7895),(129,7905),(130,361),(131,7919),(132,7929),(133,195),(134,7850),(135,7860),(136,7868),(137,7876),(138,296),(139,213),(140,7894),(141,7904),(142,360),(143,7918),(144,7928),(145,100),(146,273),(147,68),(148,272) 
		
	 
	//IF @Str IS NULL RETURN ''
    //IF @Str = '' RETURN ''
    //DECLARE @COUNTER INT
    //DECLARE @POSITION int
    //DECLARE @strOutput nvarchar(MAX),@strDebug nvarchar(MAX),@charToHop nvarchar(5),@charUnicode nvarchar(5)
    //SET @COUNTER = 148
    //SET @strOutput = ''
    //SET @strDebug =''
    //WHILE (@COUNTER > 0)
    //BEGIN
	//	SELECT @charToHop = Value FROM @UNICODEToHop AS UTH WHERE ID = @COUNTER
	//	SELECT @charUnicode = NCHAR(Value) FROM @UNICODE AS U  WHERE ID = @COUNTER
	//	
	//	--SET @strDebug =@strDebug + '#'+CAST(@COUNTER AS varchar(10))+':' +@charToHop +':' + @charUnicode
	//	IF(CHARINDEX(@charToHop,@str,1) >0)
	//	BEGIN
	//		SET @Str = REPLACE(@Str COLLATE SQL_Latin1_General_CP1_CS_AS,@charToHop COLLATE SQL_Latin1_General_CP1_CS_AS,@charUnicode COLLATE SQL_Latin1_General_CP1_CS_AS)
	//	END
	//	SET @COUNTER = @COUNTER -1
    //END
   //
   //
    //--SET @strDebug = ISNULL(@strDebug,'')+':'+ @strOutput
	//RETURN @Str 
        }
    }
}
